vynxc/VBox/rp2350_tuh_task.c
/*
 * RP2350 Enhanced TinyUSB Host Task Implementation
 * 
 * This file provides an enhanced implementation of the TinyUSB host task
 * function (tuh_task) that integrates RP2350-specific hardware acceleration.
 */

#include <stdio.h>
#include <string.h>
#include "pico/stdlib.h"
#include "defines.h"
#include "tusb.h"
#include "rp2350_tuh_task.h"

#ifdef RP2350
#include "rp2350_hw_accel.h"
#include "hardware/dma.h"
#include "hardware/pio.h"
#include "pico/stdlib.h"
#endif

// External declarations
extern void tuh_task(void);

#ifdef RP2350
// Original tuh_task function pointer
static void (*original_tuh_task)(void) = NULL;

// Flag to track if we've patched the tuh_task function
static bool tuh_task_patched = false;

// Hardware acceleration enabled flag
static bool hw_accel_enabled = false;

/**
 * @brief Enhanced TinyUSB host task with hardware acceleration
 * 
 * This function enhances the standard tuh_task() function with RP2350-specific
 * hardware acceleration features.
 */
void rp2350_enhanced_tuh_task(void) {
    // Process hardware-accelerated operations first if enabled
    if (hw_accel_enabled) {
        hw_accel_tuh_task();
    } else {
        // Call the original tuh_task function
        if (original_tuh_task != NULL) {
            original_tuh_task();
        } else {
            // Fallback to direct call if original function pointer not set
            tuh_task();
        }
    }
}

/**
 * @brief Initialize the enhanced tuh_task implementation
 * 
 * This function initializes the enhanced tuh_task implementation by
 * storing a pointer to the original tuh_task function and enabling
 * hardware acceleration if available.
 * 
 * @return true if initialization was successful, false otherwise
 */
bool rp2350_tuh_task_init(void) {
    printf("Initializing RP2350 enhanced tuh_task implementation...\n");
    
    // Store pointer to original tuh_task function
    original_tuh_task = tuh_task;
    
    // Initialize hardware acceleration
    hw_accel_enabled = hw_accel_init();
    
    // Mark tuh_task as patched
    tuh_task_patched = true;
    
    printf("RP2350 enhanced tuh_task initialization %s\n", 
           tuh_task_patched ? "successful" : "failed");
    
    return tuh_task_patched;
}

/**
 * @brief Check if hardware acceleration is enabled for tuh_task
 * 
 * @return true if hardware acceleration is enabled, false otherwise
 */
bool rp2350_tuh_task_hw_accel_enabled(void) {
    return hw_accel_enabled;
}

/**
 * @brief Get hardware acceleration statistics for tuh_task
 * 
 * This function retrieves the current hardware acceleration statistics.
 * 
 * @param stats Pointer to a hw_accel_stats_t structure to store the statistics
 */
void rp2350_tuh_task_get_stats(hw_accel_stats_t* stats) {
    if (hw_accel_enabled) {
        hw_accel_get_stats(stats);
    } else if (stats != NULL) {
        // Clear stats if hardware acceleration is not enabled
        memset(stats, 0, sizeof(hw_accel_stats_t));
    }
}

/**
 * @brief Patch the tuh_task function at runtime
 *
 * This function sets up a hook to intercept calls to tuh_task and
 * redirect them to our enhanced implementation.
 *
 * @return true if patching was successful, false otherwise
 */
bool rp2350_patch_tuh_task(void) {
    // Get the address of the original tuh_task function
    original_tuh_task = tuh_task;
    
    // Set up our hook
    // Note: In a real implementation, we would use a more sophisticated
    // approach to hook the function, such as function patching or
    // linker tricks. For this example, we'll rely on the core1_task_loop
    // to call our enhanced version directly.
    
    printf("RP2350: tuh_task patched for hardware acceleration\n");
    tuh_task_patched = true;
    return true;
}

#endif // RP2350